{
  "Article": [
    {
      "title": "An Introduction to JavaScript",
      "information": "What is JavaScript?\nJavaScript was initially created to “make web pages alive”.\n\nThe programs in this language are called scripts. They can be written right in a web page’s HTML and run automatically as the page loads.\n\nScripts are provided and executed as plain text. They don’t need special preparation or compilation to run.\n\nIn this aspect, JavaScript is very different from another language called Java.\n\nToday, JavaScript can execute not only in the browser, but also on the server, or actually on any device that has a special program called the JavaScript engine.\n\nThe browser has an embedded engine sometimes called a “JavaScript virtual machine”.\n\nDifferent engines have different “codenames”. For example:\n\nV8 – in Chrome and Opera.\nSpiderMonkey – in Firefox.\n…There are other codenames like “Chakra” for IE, “ChakraCore” for Microsoft Edge, “Nitro” and “SquirrelFish” for Safari, etc.\nThe terms above are good to remember because they are used in developer articles on the internet. We’ll use them too. For instance, if “a feature X is supported by V8”, then it probably works in Chrome and Opera.\n\nWhat can in-browser JavaScript do?\nModern JavaScript is a “safe” programming language. It does not provide low-level access to memory or CPU, because it was initially created for browsers which do not require it.\n\nJavaScript’s capabilities greatly depend on the environment it’s running in. For instance, Node.js supports functions that allow JavaScript to read/write arbitrary files, perform network requests, etc.\n\nIn-browser JavaScript can do everything related to webpage manipulation, interaction with the user, and the webserver.\n\nFor instance, in-browser JavaScript is able to:\n\nAdd new HTML to the page, change the existing content, modify styles.\nReact to user actions, run on mouse clicks, pointer movements, key presses.\nSend requests over the network to remote servers, download and upload files (so-called AJAX and COMET technologies).\nGet and set cookies, ask questions to the visitor, show messages.\nRemember the data on the client-side (“local storage”).\nWhat CAN’T in-browser JavaScript do?\nJavaScript’s abilities in the browser are limited for the sake of the user’s safety. The aim is to prevent an evil webpage from accessing private information or harming the user’s data.\n\nThere are ways to interact with camera/microphone and other devices, but they require a user’s explicit permission. So a JavaScript-enabled page may not sneakily enable a web-camera, observe the surroundings and send the information to the NSA.\n\nDifferent tabs/windows generally do not know about each other. Sometimes they do, for example when one window uses JavaScript to open the other one. But even in this case, JavaScript from one page may not access the other if they come from different sites (from a different domain, protocol or port).\n\nThis is called the “Same Origin Policy”. To work around that, both pages must agree for data exchange and contain a special JavaScript code that handles it. We’ll cover that in the tutorial.\n\nThis limitation is, again, for the user’s safety. A page from http://anysite.com which a user has opened must not be able to access another browser tab with the URL http://gmail.com and steal information from there.\n\nJavaScript can easily communicate over the net to the server where the current page came from. But its ability to receive data from other sites/domains is crippled. Though possible, it requires explicit agreement (expressed in HTTP headers) from the remote side. Once again, that’s a safety limitation.",
      "id": 1
    },
    {
      "title": "What is Artificial Intelligence?",
      "information": "Artificial intelligence (AI) is wide-ranging branch of computer science concerned with building smart machines capable of performing tasks that typically require human intelligence. AI is an interdisciplinary science with multiple approaches, but advancements in machine learning and deep learning are creating a paradigm shift in virtually every sector of the tech industry. \nHOW DOES ARTIFICIAL INTELLIGENCE WORK?\nCan machines think? — Alan Turing, 1950\n\nLess than a decade after breaking the Nazi encryption machine Enigma and helping the Allied Forces win World War II, mathematician Alan Turing changed history a second time with a simple question: \"Can machines think?\" \n\nTuring's paper \"Computing Machinery and Intelligence\" (1950), and it's subsequent Turing Test, established the fundamental goal and vision of artificial intelligence.   \n\nwhat is artificial intelligenceAt it's core, AI is the branch of computer science that aims to answer Turing's question in the affirmative. It is the endeavor to replicate or simulate human intelligence in machines.\n\nThe expansive goal of artificial intelligence has given rise to many questions and debates. So much so, that no singular definition of the field is universally accepted.  \n\nThe major limitation in defining AI as simply \"building machines that are intelligent\" is that it doesn't actually explain what artificial intelligence is? What makes a machine intelligent?\n\nIn their groundbreaking textbook Artificial Intelligence: A Modern Approach, authors Stuart Russell and Peter Norvig approach the question by unifying their work around the theme of intelligent agents in machines. With this in mind, AI is \"the study of agents that receive percepts from the environment and perform actions.\" (Russel and Norvig viii)\n\nNorvig and Russell go on to explore four different approaches that have historically defined the field of AI: \n\nThinking humanly\nThinking rationally\nActing humanly \nActing rationally\nThe first two ideas concern thought processes and reasoning, while the others deal with behavior. Norvig and Russell focus particularly on rational agents that act to achieve the best outcome, noting \"all the skills needed for the Turing Test also allow an agent to act rationally.\" (Russel and Norvig 4).\n\nPatrick Winston, the Ford professor of artificial intelligence and computer science at MIT, defines AI as  \"algorithms enabled by constraints, exposed by representations that support models targeted at loops that tie thinking, perception and action together.\"\n\nTOP AI COMPANIES HIRING NOW\nMany of the nation's top artificial intelligence companies are looking for talent. Find out who's hiring.\nView Jobs\nWhile these definitions may seem abstract to the average person, they help focus the field as an area of computer science and provide a blueprint for infusing machines and programs with machine learning and other subsets of artificial intelligence. \n\nWhile addressing a crowd at the Japan AI Experience in 2017,  DataRobot CEO Jeremy Achin began his speech by offering the following definition of how AI is used today:\n\n\"AI is a computer system able to perform tasks that ordinarily require human intelligence... Many of these artificial intelligence systems are powered by machine learning, some of them are powered by deep learning and some of them are powered by very boring things like rules.\"\n\n \nHOW IS AI USED?\nArtificial intelligence generally falls under two broad categories: \n\nNarrow AI: Sometimes referred to as \"Weak AI,\" this kind of artificial intelligence operates within a limited context and is a simulation of human intelligence. Narrow AI is often focused on performing a single task extremely well and while these machines may seem intelligent, they are operating under far more constraints and limitations than even the most basic human intelligence. \n \nArtificial General Intelligence (AGI): AGI, sometimes referred to as \"Strong AI,\" is the kind of artificial intelligence we see in the movies, like the robots from Westworld or Data from Star Trek: The Next Generation. AGI is a machine with general intelligence and, much like a human being, it can apply that intelligence to solve any problem. \nARTIFICIAL INTELLIGENCE EXAMPLES\nSmart assistants (like Siri and Alexa)\nDisease mapping and prediction tools\nManufacturing and drone robots\nOptimized, personalized healthcare treatment recommendations\nConversational bots for marketing and customer service\nRobo-advisors for stock trading\nSpam filters on email\nSocial media monitoring tools for dangerous content or false news\nSong or TV show recommendations from Spotify and Netflix\nNarrow Artificial Intelligence\nNarrow AI is all around us and is easily the most successful realization of artificial intelligence to date. With its focus on performing specific tasks, Narrow AI has experienced numerous breakthroughs in the last decade that have had \"significant societal benefits and have contributed to the economic vitality of the nation,\" according to \"Preparing for the Future of Artificial Intelligence,\" a 2016 report released by the Obama Administration. \n\nA few examples of Narrow AI include: \n\nGoogle search\nImage recognition software\nSiri, Alexa and other personal assistants\nSelf-driving cars\nIBM's Watson \nMachine Learning & Deep Learning \nMuch of Narrow AI is powered by breakthroughs in machine learning and deep learning. Understanding the difference between artificial intelligence, machine learning and deep learning can be confusing. Venture capitalist Frank Chen provides a good overview of how to distinguish between them, noting:  \n\n\"Artificial intelligence is a set of algorithms and intelligence to try to mimic human intelligence. Machine learning is one of them, and deep learning is one of those machine learning techniques.\" \n\nSimply put, machine learning feeds a computer data and uses statistical techniques to help it \"learn\" how to get progressively better at a task, without having been specifically programmed for that task, eliminating the need for millions of lines of written code. Machine learning consists of both supervised learning (using labeled data sets) and unsupervised learning (using unlabeled data sets).  \n\nDeep learning is a type of machine learning that runs inputs through a biologically-inspired neural network architecture. The neural networks contain a number of hidden layers through which the data is processed, allowing the machine to go \"deep\" in its learning, making connections and weighting input for the best results.\n\nArtificial General Intelligence\nThe creation of a machine with human-level intelligence that can be applied to any task is the Holy Grail for many AI researchers, but the quest for AGI has been fraught with difficulty. \n\nThe search for a \"universal algorithm for learning and acting in any environment,\" (Russel and Norvig 27) isn't new, but time hasn't eased the difficulty of essentially creating a machine with a full set of cognitive abilities. \n\nAGI has long been the muse of dystopian science fiction, in which super-intelligent robots overrun humanity, but experts agree it's not something we need to worry about anytime soon.",
      "id": 2
    },
    {
      "title": "Quantum Computer",
      "information": "คือ ระบบคอมพิวเตอร์ที่ทำงานด้วยศาสตร์ที่เกี่ยวข้องกับทฤษฎีควอนตัมฟิสิกส์ ต่างจากของคอมพิวเตอร์ธรรมดาซึ่งทำงานบนระบบเลขฐานสอง (Binary Digits หรือ Bits) โดยควอนตัมคอมพิวเตอร์นั้นจะใช้ Qubit (Quantum Bit) ซึ่งสามารถมีข้อมูลได้หลายสถานะในตำแหน่งเดียว ในขณะที่ Bits ธรรมดาเป็นได้เพียงแค่ 0 หรือ 1 เท่านั้น \nแม้ว่าควอนตัมคอมพิวเตอร์จะสามารถประมวลผลได้เร็วกว่าคอมพิวเตอร์ทั่วไป แต่ในปัจจุบันก็ยังถูกใช้อยู่เพียงแค่ในวงการวิจัยทางวิทยาศาสตร์ เนื่องจากยังมีความสามารถอีกหลายด้านที่ยังไม่ถูกค้นพบ รวมถึงต้องใช้ข้อมูลปริมาณมหาศาลเพื่อให้ควอนตัมคอมพิวเตอร์แสดงประสิทธิภาพได้อย่างเต็มที่\n\n",
      "id": 4
    }
  ]
}